; Laser Weapons item localization 
; this includes schematics, as of 13 Oct 2015 update
; this includes ability descriptor, as of 5 Jan 2016 update
; this includes techs, as of 12 March 2016 update

[AssaultRifle_LS X2WeaponTemplate]
FriendlyName="脉冲步枪"
FriendlyNamePlural="脉冲步枪"
BriefSummary="脉冲步枪发射出一系列微秒级别的光波，能够破坏目标的化学键。"
TacticalText="<Bullet/>若没有经过特殊训练，用主武器射击将会结束该士兵的回合。\n<Bullet/>使用从变种人敌人身上取得的升级部件提升脉冲步枪的战术效率。\n<Bullet/>该激光武器的高能输出是将外星技术集成到战前激光武器而得来的。"
AbilityDescName="突击步枪"

[SMG_LS X2WeaponTemplate]
FriendlyName="脉冲斯登枪"
FriendlyNamePlural="脉冲斯登枪"
BriefSummary="脉冲步枪的轻便版本，担任与冲锋枪类似的角色，以威力，弹药和远距离精度为代价，为士兵提供更高的移动力和隐蔽性。"
TacticalText="<Bullet/>若没有经过特殊训练，用主武器射击将会结束该士兵的回合。\n<Bullet/>使用从变种人敌人身上取得的升级部件提升轻机枪的战术效率。\n<Bullet/>冲锋枪类型的武器相比突击步枪提供额外的移动力，近程精度以及隐蔽性，但它们的伤害更低，弹药更少，并且在远距离有精度减益。"
AbilityDescName="冲锋枪"

[Cannon_LS X2WeaponTemplate]
FriendlyName="脉冲加农炮"
FriendlyNamePlural="脉冲加农炮"
BriefSummary="脉冲武器技术中包含了一项改进的冷却系统，能让我们部署一种能连发射击的加农炮，能够倾泻更加致命的火力。"
TacticalText="<Bullet/>脉冲加农炮是一种威力巨大版的磁力加农炮，且同样易于部署。\n<Bullet/>使用从敌人身上收集的升级部件提升脉冲加农炮的战术效率。"
AbilityDescName="加农炮"

[Shotgun_LS X2WeaponTemplate]
FriendlyName="散射爆裂枪"
FriendlyNamePlural="散射爆裂枪"
BriefSummary="散射爆裂枪是一种脉冲激光技术的应用，以提供类似霰弹枪的效果；由于光漫射，它在近距离威力最为巨大。"
TacticalText="\n<Bullet/>霰弹型武器在近距离极为有效，但是它们的命中率在远距离下降得很快。\n<Bullet/>使用从敌人身上取得的升级部件提升散射爆裂枪的战术效率。"
AbilityDescName="霰弹枪"

[SniperRifle_LS X2WeaponTemplate]
FriendlyName="脉冲长枪"
FriendlyNamePlural="脉冲长枪"
BriefSummary="作为脉冲步枪的远距离步枪版本，脉冲长枪集成了极度高能的闪光电容，结果成就了此高精度远距离的激光武器。"
TacticalText="<Bullet/>狙击步枪总是需要2个行动点来射击。\n<Bullet/>它们在近距离精确度不高，但是在远距离具有致命的杀伤能力。\n<Bullet/>使用从敌人身上取得的升级部件提升脉冲长枪的战术效率。"
AbilityDescName="狙击步枪"

[Pistol_LS X2WeaponTemplate]
FriendlyName="脉冲手枪"
FriendlyNamePlural="脉冲手枪"
BriefSummary="一种简单的脉冲发射器，能够用作副武器。"
TacticalText="<Bullet/>脉冲手枪相比磁力手枪更有效率。\n<Bullet/>手枪开火需要1个行动点。"
AbilityDescName="手枪"

[LaserWeaponsTech_LW X2TechTemplate]
DisplayName="脉冲激光武器"
Summary="利用我们对于磁力学和外星超铀的全新理解，我们应当能够开发一种强力的激光武器。"
CodeName="中后卫"
LongDescription="通过研究外星人在武器上管理能量消耗和散热的技术，我们成功完成了一种工程原型机，我们将其称之为脉冲激光武器，虽然一些士兵更喜欢叫它们「爆破手」，原因我不太清楚。这些武器能够输出的能量令人叹为观止，但其系统无法维持如此大量的光束输出，因此它的架构依靠一系列的皮秒级的，高能量密度的脉冲去打破光束击中目标的化学键。平均计算，这些武器应当能够比我们之前开发的磁力武器造成更大的伤害，虽然它们还比不上那些外星人使用的电浆光束设备。理查德·泰根。"

[AdvancedLaserWeaponsTech_LW X2TechTemplate]
DisplayName="高级脉冲激光"
Summary="随着对脉冲激光技术基础的完全理解，我们相信现在能够为军队开发一些专用脉冲激光武器。"
CodeName="支点"
LongDescription="感谢军队和工程团队的反馈，我们现在对脉冲武器技术有了更全面的理解，因此现在我们能够进一步在光学，脉冲频率，电容器方面对脉冲武器设计进行改进，以此开发出一系列能运用在不同战场上的武器。理查德·泰根。"
